OpenFOAM/foam9tutorials/tutorials/combustion/reactingFoam/Lagrangian/filter/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

# create mesh
runApplication blockMesh

# create sets
runApplication topoSet

# create baffles and fields
runApplication createBaffles -overwrite

runApplication $application

#------------------------------------------------------------------------------
